Revit 2027 API
FabricationConfiguration.SeamExists Method
 Checks to see if the specified seam exists in the fabrication database.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool SeamExists(
	int seamId
)
Public Function SeamExists (
	seamId As Integer
) As Boolean
public:
bool SeamExists(
	int seamId
)
member SeamExists :
        seamId : int -> bool
Parameters
seamId Int32
 The seam identifier to check.
Return Value
Boolean
 Returns true if the seam exists.
See Also
Reference
FabricationConfiguration Class
Autodesk.Revit.DB Namespace